app/views/genres/index.html.erb

<h1>Genres</h1>
<% if Array(User.where(:id => session[:user_id])).first.id == 6 %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1