app/views/questions/index.html.erb


<% if Array(User.where(:id => session[:user_id])).first.id == 6 %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1

<br>
<%= link_to 'Back', {:controller => "subgenres", :action => "index", :genre => Subgenre.find_by_genre_id(params[:subgenre])} %>
---
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`subgenre_id` = '5' ORDER BY `subgenres`.`id` ASC LIMIT 1