app/views/leaderboards/index.html.erb

</table>
<% if Array(User.where(:id => session[:user_id])).first.id != 6 %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1