app/views/player/index.html.erb

<p align="right">logged in as <%= Array(User.where(id: session[:user_id])).first.email %></p>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1