app/views/admin/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
---
<% if Array(User.where(:id => session[:user_id])).first.id == 6 %>