app/views/scores/index.html.erb

SELECT  `scores`.* FROM `scores` WHERE `scores`.`user_id` = 4 AND `scores`.`subgenre_id` = 1 LIMIT 1
---
  <tbody>
    <% @scores = Score.where(user_id: params[:user], subgenre_id: params[:subgenre]) %>