app/views/options/index.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
---

<% if Array(User.where(:id => session[:user_id])).first.id == 6 %>

SELECT  `options`.* FROM `options` WHERE `options`.`question_id` IS NULL LIMIT 1
---
    <br/><b><%= question.qtype+" answer" %></b><br/><br/><%= label_tag question.name %>
    <% @opt = Option.where(question_id: question.id) %>

SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 ORDER BY `subgenres`.`id` ASC LIMIT 1
---
  <br/>
  <%= link_to "Finish Quiz", {:controller => 'scores', :action => 'index', user: Array(User.where(:id => session[:user_id])).first.id, subgenre: params[:subgenre]} %>