app/views/subgenres/index.html.erb

<h1>Subgenres</h1>
<% if Array(User.where(:id => session[:user_id])).first.id == 6 %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1