app/controllers/leaderboards_controller.rb

SELECT `leaderboards`.* FROM `leaderboards`
---
  def index
    @leaderboards = Leaderboard.all

SELECT  `leaderboards`.* FROM `leaderboards` WHERE `leaderboards`.`id` = 1 LIMIT 1
---
    def set_leaderboard
      @leaderboard = Leaderboard.find(params[:id])