app/controllers/options_controller.rb

SELECT  `options`.* FROM `options` WHERE `options`.`question_id` IS NULL LIMIT 1
SELECT  `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` IS NULL LIMIT 1
---
  def index
    @options = Option.where(question_id: params[:question])
    @questions = Question.where(subgenre_id: params[:subgenre])

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
INSERT INTO `options` (`no`, `name`, `answer`, `question_id`, `created_at`, `updated_at`) VALUES (1, 'India', 1, 1, '2017-09-16 15:27:08', '2017-09-16 15:27:08')
SELECT  `options`.* FROM `options` WHERE `options`.`id` IS NULL LIMIT 1
SELECT  `scores`.* FROM `scores` WHERE `scores`.`user_id` = 4 AND `scores`.`subgenre_id` = 1 LIMIT 1
INSERT INTO `scores` (`value`, `user_id`, `subgenre_id`, `created_at`, `updated_at`) VALUES (0, 4, 1, '2017-09-18 19:29:30', '2017-09-18 19:29:30')
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` = 1 LIMIT 1
UPDATE `scores` SET `value` = 10, `updated_at` = '2017-09-18 19:44:34' WHERE `scores`.`id` = 3
---
  def create
    if Array(User.where(:id => session[:user_id])).first.id == 6
      @option = Option.new(option_params)

      respond_to do |format|
        if @option.save
          format.html { redirect_to @option, notice: 'Option was successfully created.' }
          format.json { render :show, status: :created, location: @option }
        else
          format.html { render :new }
          format.json { render json: @option.errors, status: :unprocessable_entity }
        end
      end

    else
      @i = 1
      flag = false
      while @i<=5
        @options = Array(Option.find_by_id(params[:name[@i]])).first
        @i = @i+1
        if @options
          if @options.answer
            flag=true
            puts 'yes------------------------------'
          else
            flag = false
            puts 'no-------------------------------'
          end
        end
      end
      @score = Score.find_by(user_id: Array(User.where(:id => session[:user_id])).first.id, subgenre_id: params[:subgenre])
      if !@score
        @score = Score.create(value: 0, user_id: Array(User.where(:id => session[:user_id])).first.id, subgenre_id: params[:subgenre])
      end
      if flag
        s = @score.value + 5
        @score.update(value: s)

UPDATE `options` SET `name` = 'Ind', `updated_at` = '2017-09-16 16:52:46' WHERE `options`.`id` = 1
---
  def update
    respond_to do |format|
      if @option.update(option_params)

DELETE FROM `options` WHERE `options`.`id` = 4
---
  def destroy
    @id = @option.question_id
    @option.destroy

SELECT `options`.* FROM `options` WHERE `options`.`id` IN (NULL, NULL)
---
    def set_option
      @option = Option.find(params[:id])