app/controllers/questions_controller.rb

SELECT  `questions`.* FROM `questions` WHERE `questions`.`subgenre_id` IS NULL LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`subgenre_id` = '5' ORDER BY `subgenres`.`id` ASC LIMIT 1
---
  def index
    @questions = Question.where(subgenre_id: params[:subgenre])

INSERT INTO `questions` (`name`, `qtype`, `subgenre_id`, `created_at`, `updated_at`) VALUES ('Who won the world cup in 2011?', 'single', 1, '2017-09-16 13:40:59', '2017-09-16 13:40:59')
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE `questions` SET `name` = 'Who won the world cup in 2011', `updated_at` = '2017-09-16 16:51:47' WHERE `questions`.`id` = 1
---
  def update
    respond_to do |format|
      if @question.update(question_params)

DELETE FROM `questions` WHERE `questions`.`id` = 2
---
  def destroy
    @id = @question.subgenre_id
    @question.destroy

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 2 LIMIT 1
---
    def set_question
      @question = Question.find(params[:id])