app/controllers/scores_controller.rb

  def index
    @scores = Score.all
    @u = Array(User.where(:id => session[:user_id])).first.id
    @s = params[:subgenre]
    @g = Subgenre.where(id: @s).first.genre_id
    @score = Score.find_by(user_id: @u, subgenre_id: @s).value
    @leaderboard = Leaderboard.create(user_id: @u, subgenre_id: @s, genre_id: @s, value: @score)
---
SELECT `scores`.* FROM `scores`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
SELECT  `genres`.* FROM `genres` WHERE `genres`.`subgenre_id` = '1' ORDER BY `genres`.`id` ASC LIMIT 1
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`subgenre_id` = '1' ORDER BY `subgenres`.`id` ASC LIMIT 1
SELECT  `scores`.* FROM `scores` WHERE `scores`.`user_id` = 4 AND `scores`.`subgenre_id` = 1 LIMIT 1
INSERT INTO `leaderboards` (`user_id`, `genre_id`, `subgenre_id`, `value`, `created_at`, `updated_at`) VALUES (4, 1, 1, 35, '2017-09-19 11:32:58', '2017-09-19 11:32:58')