app/controllers/subgenres_controller.rb

  def index
    @subgenres = Subgenre.where(genre_id: params[:genre])
---
SELECT  `subgenres`.* FROM `subgenres` WHERE `subgenres`.`genre_id` IS NULL LIMIT 1

  def create
    @subgenre = Subgenre.new(subgenre_params)

    respond_to do |format|
      if @subgenre.save
---
INSERT INTO `subgenres` (`name`, `genre_id`, `created_at`, `updated_at`) VALUES ('Cricket', 1, '2017-09-16 13:40:11', '2017-09-16 13:40:11')

  def update
    respond_to do |format|
      if @subgenre.update(subgenre_params)
---
UPDATE `subgenres` SET `name` = 'Cricke', `updated_at` = '2017-09-16 16:45:43' WHERE `subgenres`.`id` = 1

  def destroy
    @id = @subgenre.genre_id
    @subgenre.destroy
---
DELETE FROM `subgenres` WHERE `subgenres`.`id` = 2

    def set_subgenre
      @subgenre = Subgenre.find(params[:id])
---
SELECT  `genres`.* FROM `genres` WHERE `genres`.`id` = 1 LIMIT 1
SELECT `subgenres`.* FROM `subgenres` WHERE `subgenres`.`id` IN (NULL, NULL)