app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`email`, `password_digest`, `created_at`, `updated_at`) VALUES ('karthikaramineni@gmail.com', '$2a$10$Qq18LHNIfFwpfLBWiL4mJuASNHz4yHwYrJWZqAMSVMMfrNTRBemFu', '2017-09-15 17:54:25', '2017-09-15 17:54:25')

    def set_user
      @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1